ivost/ble_app_nordic_thingy_nrf52_dk/ble_tes_c.h
/**
 * Copyright (c) 2016 - 2018, Nordic Semiconductor ASA
 * 
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 * 
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 * 
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 * 
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 * 
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * 
 */
/**@file
 *
 * @defgroup ble_tes_c Thingy Enviroment Service Client
 * @{
 * @ingroup  ble_sdk_srv
 * @brief    The Thingy Enviroment Service client can be used to set a LED, and read a button state on a
 *           Thingy Enviroment service server.
 *
 * @details  This module contains the APIs and types exposed by the Thingy Enviroment Service Client
 *           module. These APIs and types can be used by the application to perform discovery of
 *           Thingy Enviroment Service at the peer and interact with it.
 *
 * @note    The application must register this module as BLE event observer using the
 *          NRF_SDH_BLE_OBSERVER macro. Example:
 *          @code
 *              ble_tes_c_t instance;
 *              NRF_SDH_BLE_OBSERVER(anything, BLE_tes_C_BLE_OBSERVER_PRIO,
 *                                   ble_tes_c_on_ble_evt, &instance);
 *          @endcode
 */

#ifndef BLE_TES_C_H__
#define BLE_TES_C_H__

#include <stdint.h>
#include "ble.h"
#include "ble_db_discovery.h"
#include "nrf_sdh_ble.h"

#ifdef __cplusplus
extern "C" {
#endif

/**@brief   Macro for defining a ble_tes_c instance.
 *
 * @param   _name   Name of the instance.
 * @hideinitializer
 */
#define BLE_TES_C_DEF(_name)                                                                        \
static ble_tes_c_t _name;                                                                           \
NRF_SDH_BLE_OBSERVER(_name ## _obs,                                                                 \
                     BLE_TES_C_BLE_OBSERVER_PRIO,                                                   \
                     ble_tes_c_on_ble_evt, &_name)

/**@brief   Macro for defining multiple ble_tes_c instances.
 *
 * @param   _name   Name of the array of instances.
 * @param   _cnt    Number of instances to define.
 */
#define BLE_TES_C_ARRAY_DEF(_name, _cnt)                                                            \
static ble_tes_c_t _name[_cnt];                                                                     \
NRF_SDH_BLE_OBSERVERS(_name ## _obs,                                                                \
                      BLE_TES_C_BLE_OBSERVER_PRIO,                                                  \
                      ble_tes_c_on_ble_evt, &_name, _cnt)

//#define TES_BASE_UUID                 {0x42, 0x00, 0x74, 0xA9, 0xFF, 0x52, 0x10, 0x9B, 0x33, \
//                          0x49, 0x35, 0x9B, 0x00, 0x00, 0x68, 0xEF} /**< Used vendor specific UUID. */
// EF68xxxx-9B35-4933-9B10-52FFA9740042 => Weather UUID
// EF68xxxx-9B35-4933-9B10-52FFA9740042
#define TES_BASE_UUID                 {0x42, 0x00, 0x74, 0xA9, 0xFF, 0x52, 0x10, 0x9B, 0x33, 0x49, 0x35, 0x9B, 0x00, 0x00, 0x68, 0xEF} /**< Used vendor specific UUID. */
#define BLE_UUID_TES_SERVICE          0x0200                      /**< The UUID of the Thingy Environment Service. */
#define BLE_UUID_MOT_SERVICE          0x0400
#define BLE_UUID_TES_TEMPERATURE_CHAR 0x0201                      /**< The UUID of the temperature Characteristic. */
#define BLE_UUID_TES_PRESSURE_CHAR    0x0202                      /**< The UUID of the pressure Characteristic. */
#define BLE_UUID_TES_HUMIDITY_CHAR    0x0203                      /**< The UUID of the humidity Characteristic. */
#define BLE_UUID_TES_GAS_CHAR         0x0204                      /**< The UUID of the gas Characteristic. */
#define BLE_UUID_TES_COLOR_CHAR       0x0205                      /**< The UUID of the gas Characteristic. */
#define BLE_UUID_TES_CONFIG_CHAR      0x0206                      /**< The UUID of the config Characteristic. */


#define THINGY_UIS_UUID_SERVICE     0x0300
#define THINGY_UIS_UUID_BUTTON_CHAR 0x0302
#define THINGY_UIS_UUID_LED_CHAR    0x0301

#define THINGY_TES_UUID_SERVICE          0x0400
#define THINGY_TES_UUID_CONFIG_CHAR      0x0401                      /**< The UUID of the config Characteristic. */
#define THINGY_TES_UUID_TAP_CHAR         0x0402                      /**< The UUID of the tap Characteristic. */
#define THINGY_TES_UUID_ORIENTATION_CHAR 0x0403                      /**< The UUID of the orientation Characteristic. */
#define THINGY_TES_UUID_QUATERNION_CHAR  0x0404                      /**< The UUID of the quaternion Characteristic. */
#define THINGY_TES_UUID_PEDOMETER_CHAR   0x0405                      /**< The UUID of the pedometer Characteristic. */
#define THINGY_TES_UUID_RAW_CHAR         0x0406 // test should be 407     /**< The UUID of the raw data Characteristic. */
#define THINGY_TES_UUID_EULER_CHAR       0x0407                      /**< The UUID of the euler Characteristic. */
#define THINGY_TES_UUID_ROT_MAT_CHAR     0x0408                      /**< The UUID of the rotation matrix Characteristic. */
#define THINGY_TES_UUID_HEADING_CHAR     0x0409                      /**< The UUID of the compass heading Characteristic. */
#define THINGY_TES_UUID_GRAVITY_CHAR     0x040A                      /**< The UUID of the gravity vector Characteristic. */
/**@brief TES Client event type. */
typedef enum
{
    BLE_TES_C_EVT_DISCOVERY_COMPLETE = 1,       /**< Event indicating that the Thingy enviroment Service has been discovered at the peer. */
    BLE_TES_C_EVT_RAW_NOTIFICATION     /**< Event indicating that a notification of the Thingy Motion RAW characteristic has been received from the peer. Can't handle this yet. */         
} ble_tes_c_evt_type_t;

// struct to hadle RAW motion data.
// Accelerometer, gyroscope and compass data.  
typedef struct
{
    int16_t x_acc; // Accelerometer data 16-bit integer
    int16_t y_acc;
    int16_t z_acc;

